Repository: fluentmigrator/fluentmigrator
Catalog: src/FluentMigrator.Abstractions/MultilingualResources/FluentMigrator.Abstractions.*.xlf
Languages: de_de

# ColumnNameCannotBeNullOrEmpty
source: The column's name cannot be null or an empty string.
de_de: Der Spaltenname darf nicht null oder leer sein.

source: Column names must be unique.
de_de: Spaltennamen müssen eindeutig sein.

# ColumnTypeMustBeDefined
source: The column does not have a type defined.
de_de: Die Spalte hat keinen definierten Typen.

# ConstraintMustHaveAtLeastOneColumn
source: The constraint must have at least one column specified.
de_de: Die Einschränkung muss mindestens eine Spalte umfassen.

# DefaultValueCannotBeNull
source: The default value cannot be null.
de_de: Der Standard-Wert darf nicht null sein.

# DestinationSchemaCannotBeNull
source: The destination schema's name cannot be null or an empty string.
de_de: Der Schema-Name des Ziels darf nicht null oder leer sein.

# ForeignKeyMustHaveOneOrMoreForeignColumns
source: The foreign key must have one or more foreign columns.
de_de: Der Fremdschlüssel muss eine oder mehrere referenzierenden Spalten umfassen.

# ForeignKeyMustHaveOneOrMorePrimaryColumns
source: The foreign key must have one or more primary columns.
de_de: Der Fremdschlüssel muss eine oder mehrere Primärspalten umfassen.

# ForeignKeyNameCannotBeNullOrEmpty
source: The foreign key's name cannot be null or an empty string.
de_de: Der Fremdschlüssel-Name darf nicht null oder leer sein.

# ForeignTableNameCannotBeNullOrEmpty
source: The foreign table name cannot be null or empty.
de_de: Der Name der referenzierenden Tabelle darf nicht null oder leer sein.

# IndexMustHaveOneOrMoreColumns
source: The index must have one or more columns.
de_de: Der Index muss eine oder mehrere Spalten umfassen.

# IndexNameCannotBeNullOrEmpty
source: The index's name cannot be null or an empty string.
de_de: Der Index-Name darf nicht null oder leer sein.

# NewColumnNameCannotBeNullOrEmpty
source: The new column name cannot be null or empty.
de_de: Der neue Spaltenname darf nicht null oder leer sein.

# NewTableNameCannotBeNullOrEmpty
source: The new table name cannot be null or empty.
de_de: Der neue Tabellenname darf nicht null oder leer sein.

# OldColumnNameCannotBeNullOrEmpty
source: The old column name cannot be null or empty.
de_de: Der alte Spaltenname darf nicht null oder leer sein.

# OldTableNameCannotBeNullOrEmpty
source: The old table name cannot be null or empty.
de_de: Der alte Tabellenname darf nicht null oder leer sein.

# OperationCannotBeNull
source: The operation to be performed using the database connection cannot be null.
de_de: Die auf der Datenbankverbindung auszuführende Aktion darf nicht null sein.

# PrimaryTableNameCannotBeNullOrEmpty
source: The primary table name cannot be null or empty.
de_de: Der primäre Tabellenname darf nicht null oder leer sein.

# SchemaNameCannotBeNullOrEmpty
source: The schema's name cannot be null or an empty string.
de_de: Der Schema-Name darf nicht null oder leer sein.

# SequenceNameCannotBeNullOrEmpty
source: The sequence's name cannot be null or an empty string.
de_de: Der Sequenz-Name darf nicht null oder leer sein.

# SqlScriptCannotBeNullOrEmpty
source: The sql script cannot be null or an empty string.
de_de: Das SQL-Script darf nicht null oder leer sein.

# SqlStatementCannotBeNullOrEmpty
source: The sql statement cannot be null or an empty string.
de_de: Die SQL-Anweisung darf nicht null oder leer sein.

# TableNameCannotBeNullOrEmpty
source: The table's name cannot be null or an empty string.
de_de: Der Tabellenname darf nicht null oder leer sein.

# UpdateDataExpressionMustNotSpecifyBothWhereClauseAndAllRows
source: Update statement specifies both a .Where() condition and that .AllRows() should be targeted. Specify one or the other, but not both.
de_de: Die Update-Anweisung spezifiziert sowohl eine .Where()-Bedingung und auch, dass .AllRows() als Ziel gewählt werden sollen. Nur eines von beiden darf angegeben werden.

# UpdateDataExpressionMustSpecifyWhereClauseOrAllRows
source: Update statement is missing a condition. Specify one by calling .Where() or target all rows by calling .AllRows().
de_de: Der Update-Anweisung fehlt eine Bedingung, wie z.B. .Where() für einen oder mehrere Datensätze oder .AllRows() für alle Datensätze.

# MethodXMustBeCalledOnObjectImplementingY
source: The {0} method must be called on an object that implements {1}.
de_de: Die Methode {0} darf nur auf einem Objekt aufgerufen werden, dass {1} implementiert.

# ExpressionTableNameMissing
source: expression.TableName must not be empty
de_de: expression.TableName darf nicht leer sein

# ExpressionTableNameMissingWithHints
source: Table name not specified, ensure you have appended the OnTable extension. Format should be Delete.ForeignKey(KeyName).OnTable(TableName)
de_de: Der Tabellenname wurde nicht angegeben. Stellen Sie sicher, dass sie die "OnTable"-Erweiterungsmethode aufgerufen haben. Der Aufruf sollte wie folgt aussehen: Delete.ForeignKey(KeyName).OnTable(TableName)

# IndexIncludeColumnNameMustNotBeNullOrEmpty
source: The index include column's name must not be null or an empty string.
de_de: Der Name der Index-Include-Spalte darf nicht null oder leer sein.

# ForeignKeyMustNotHaveColumnNameBeNullOrEmpty
source: The foreign key must not have a column name be null or an empty string.
de_de: Der Fremdschlüssel-Name darf nicht null oder leer sein.

# PrimaryKeyColumnNameReferencedByForeignKeyMustNotBeNullOrEmpty
source: The primary key column name referenced by the foreign key must not be null or an empty string.
de_de: Der Name der vom Fremdschlüssel referenzierten Primärschlüsselspalte darf nicht null oder leer sein.

# ForeignKeyColumnsCountMustMatchPrimaryKeyColumnsCount
source: The foreign key columns' count must match the primary key columns' count.
de_de: Die Anzahl der Fremdschlüsselspalten muss mit der Anzahl der Primärschlüsselspalten übereinstimmen.

# ForeignKeyColumnNamesMustBeUnique
source: The foreign key column names must be unique.
de_de: Die Anzahl der Fremdschlüsselspalten müssen eindeutig sein.

# PrimaryKeyColumnNamesMustBeUnique
source: The primary key column names must be unique.
de_de: Die Anzahl der Primärschlüsselspalten müssen eindeutig sein.
